<a href="https://colab.research.google.com/github/Abinvarghese07/CNN-machine-learning-AI/blob/main/janatha_hack_abin_CNN_ML/AI.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
train = pd.read_csv('/content/Train_aBjfeNk.csv')
test = pd.read_csv('/content/Test_LqhgPWU.csv')

In [ ]:
test.head()

       ID  Gender Ever_Married  ...  Spending_Score Family_Size  Var_1
0  458989  Female          Yes  ...             Low         1.0  Cat_6
1  458994    Male          Yes  ...         Average         4.0  Cat_6
2  458996  Female          Yes  ...             Low         1.0  Cat_6
3  459000    Male          Yes  ...            High         2.0  Cat_6
4  459001  Female           No  ...             Low         4.0  Cat_6

[5 rows x 10 columns]

In [ ]:
train.head()

       ID  Gender Ever_Married  ...  Family_Size  Var_1 Segmentation
0  462809    Male           No  ...          4.0  Cat_4            D
1  462643  Female          Yes  ...          3.0  Cat_4            A
2  466315  Female          Yes  ...          1.0  Cat_6            B
3  461735    Male          Yes  ...          2.0  Cat_6            B
4  462669  Female          Yes  ...          6.0  Cat_6            A

[5 rows x 11 columns]

In [ ]:
#checking null values
train.isna().sum()

ID                   0
Gender               0
Ever_Married       140
Age                  0
Graduated           78
Profession         124
Work_Experience    829
Spending_Score       0
Family_Size        335
Var_1               76
Segmentation         0
dtype: int64

In [ ]:
test.isna().sum()

ID                   0
Gender               0
Ever_Married        50
Age                  0
Graduated           24
Profession          38
Work_Experience    269
Spending_Score       0
Family_Size        113
Var_1               32
dtype: int64

In [ ]:
train.columns

Index(['ID', 'Gender', 'Ever_Married', 'Age', 'Graduated', 'Profession',
       'Work_Experience', 'Spending_Score', 'Family_Size', 'Var_1',
       'Segmentation'],
      dtype='object')

In [ ]:
for feature in train.columns:
  train[feature] = train[feature].fillna(train[feature].mode()[0])

In [ ]:
train.isna().sum()

ID                 0
Gender             0
Ever_Married       0
Age                0
Graduated          0
Profession         0
Work_Experience    0
Spending_Score     0
Family_Size        0
Var_1              0
Segmentation       0
dtype: int64

In [ ]:
test.columns

Index(['ID', 'Gender', 'Ever_Married', 'Age', 'Graduated', 'Profession',
       'Work_Experience', 'Spending_Score', 'Family_Size', 'Var_1'],
      dtype='object')

In [ ]:
for feature in test.columns:
  test[feature] = test[feature].fillna(test[feature].mode()[0])

In [ ]:
test.head()

       ID  Gender Ever_Married  ...  Spending_Score Family_Size  Var_1
0  458989  Female          Yes  ...             Low         1.0  Cat_6
1  458994    Male          Yes  ...         Average         4.0  Cat_6
2  458996  Female          Yes  ...             Low         1.0  Cat_6
3  459000    Male          Yes  ...            High         2.0  Cat_6
4  459001  Female           No  ...             Low         4.0  Cat_6

[5 rows x 10 columns]

In [ ]:
test.isna().sum()

ID                 0
Gender             0
Ever_Married       0
Age                0
Graduated          0
Profession         0
Work_Experience    0
Spending_Score     0
Family_Size        0
Var_1              0
dtype: int64

In [ ]:
train.nunique()

ID                 8068
Gender                2
Ever_Married          2
Age                  67
Graduated             2
Profession            9
Work_Experience      15
Spending_Score        3
Family_Size           9
Var_1                 7
Segmentation          4
dtype: int64

In [ ]:
train = train.drop('ID',axis = 1)

In [ ]:
train.head()

   Gender Ever_Married  Age  ... Family_Size  Var_1  Segmentation
0    Male           No   22  ...         4.0  Cat_4             D
1  Female          Yes   38  ...         3.0  Cat_4             A
2  Female          Yes   67  ...         1.0  Cat_6             B
3    Male          Yes   67  ...         2.0  Cat_6             B
4  Female          Yes   40  ...         6.0  Cat_6             A

[5 rows x 10 columns]

In [ ]:
test.head()

       ID  Gender Ever_Married  ...  Spending_Score Family_Size  Var_1
0  458989  Female          Yes  ...             Low         1.0  Cat_6
1  458994    Male          Yes  ...         Average         4.0  Cat_6
2  458996  Female          Yes  ...             Low         1.0  Cat_6
3  459000    Male          Yes  ...            High         2.0  Cat_6
4  459001  Female           No  ...             Low         4.0  Cat_6

[5 rows x 10 columns]

In [ ]:
df_test = test.copy()

In [ ]:
df_test.head()

       ID  Gender Ever_Married  ...  Spending_Score Family_Size  Var_1
0  458989  Female          Yes  ...             Low         1.0  Cat_6
1  458994    Male          Yes  ...         Average         4.0  Cat_6
2  458996  Female          Yes  ...             Low         1.0  Cat_6
3  459000    Male          Yes  ...            High         2.0  Cat_6
4  459001  Female           No  ...             Low         4.0  Cat_6

[5 rows x 10 columns]

In [ ]:
df_test = df_test.drop('ID',axis = 1)

In [ ]:
df_test.head()

   Gender Ever_Married  Age  ... Spending_Score Family_Size  Var_1
0  Female          Yes   36  ...            Low         1.0  Cat_6
1    Male          Yes   37  ...        Average         4.0  Cat_6
2  Female          Yes   69  ...            Low         1.0  Cat_6
3    Male          Yes   59  ...           High         2.0  Cat_6
4  Female           No   19  ...            Low         4.0  Cat_6

[5 rows x 9 columns]

In [ ]:
#label encoding
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [ ]:
columns = ['Gender','Ever_Married','Graduated']
for cols in columns:
  train[cols] = le.fit_transform(train[cols])

In [ ]:
train.head()

   Gender  Ever_Married  Age  ...  Family_Size  Var_1  Segmentation
0       1             0   22  ...          4.0  Cat_4             D
1       0             1   38  ...          3.0  Cat_4             A
2       0             1   67  ...          1.0  Cat_6             B
3       1             1   67  ...          2.0  Cat_6             B
4       0             1   40  ...          6.0  Cat_6             A

[5 rows x 10 columns]

In [ ]:
for cols in columns:
  df_test[cols] = le.fit_transform(df_test[cols])

In [ ]:
df_test.head()

   Gender  Ever_Married  Age  ...  Spending_Score Family_Size  Var_1
0       0             1   36  ...             Low         1.0  Cat_6
1       1             1   37  ...         Average         4.0  Cat_6
2       0             1   69  ...             Low         1.0  Cat_6
3       1             1   59  ...            High         2.0  Cat_6
4       0             0   19  ...             Low         4.0  Cat_6

[5 rows x 9 columns]

In [ ]:
#one hot encoding
train['Profession'].value_counts()

Artist           2640
Healthcare       1332
Entertainment     949
Engineer          699
Doctor            688
Lawyer            623
Executive         599
Marketing         292
Homemaker         246
Name: Profession, dtype: int64

In [ ]:
train['Var_1'].value_counts()

Cat_6    5314
Cat_4    1089
Cat_3     822
Cat_2     422
Cat_7     203
Cat_1     133
Cat_5      85
Name: Var_1, dtype: int64

In [ ]:
train['Profession'] = train['Profession'].replace(['Lawyer','Executive','Marketing','Homemaker'],'other')

In [ ]:
train['Profession'].value_counts()

Artist           2640
other            1760
Healthcare       1332
Entertainment     949
Engineer          699
Doctor            688
Name: Profession, dtype: int64

In [ ]:
train['Var_1'] = train['Var_1'].replace(['Cat_7','Cat_1','Cat_5'],'other')

In [ ]:
train['Var_1'].value_counts()

Cat_6    5314
Cat_4    1089
Cat_3     822
Cat_2     422
other     421
Name: Var_1, dtype: int64

In [ ]:
df_test['Profession'] = df_test['Profession'].replace(['Lawyer','Executive','Marketing','Homemaker'],'other')
df_test['Profession'].value_counts()

Artist           840
other            590
Healthcare       418
Entertainment    301
Doctor           242
Engineer         236
Name: Profession, dtype: int64

In [ ]:
df_test['Var_1'] = df_test['Var_1'].replace(['Cat_7','Cat_1','Cat_5'],'other')
df_test['Var_1'].value_counts()

Cat_6    1704
Cat_4     386
Cat_3     267
Cat_2     141
other     129
Name: Var_1, dtype: int64

In [ ]:
df_test.head()

   Gender  Ever_Married  Age  ...  Spending_Score Family_Size  Var_1
0       0             1   36  ...             Low         1.0  Cat_6
1       1             1   37  ...         Average         4.0  Cat_6
2       0             1   69  ...             Low         1.0  Cat_6
3       1             1   59  ...            High         2.0  Cat_6
4       0             0   19  ...             Low         4.0  Cat_6

[5 rows x 9 columns]

In [ ]:
#one hot encoding
train = pd.get_dummies(train,columns=['Profession','Var_1'])

In [ ]:
train.head()

   Gender  Ever_Married  Age  ...  Var_1_Cat_4  Var_1_Cat_6 Var_1_other
0       1             0   22  ...            1            0           0
1       0             1   38  ...            1            0           0
2       0             1   67  ...            0            1           0
3       1             1   67  ...            0            1           0
4       0             1   40  ...            0            1           0

[5 rows x 19 columns]

In [ ]:
df_test = pd.get_dummies(df_test,columns=['Profession','Var_1'])

In [ ]:
df_test.head()

   Gender  Ever_Married  Age  ...  Var_1_Cat_4  Var_1_Cat_6 Var_1_other
0       0             1   36  ...            0            1           0
1       1             1   37  ...            0            1           0
2       0             1   69  ...            0            1           0
3       1             1   59  ...            0            1           0
4       0             0   19  ...            0            1           0

[5 rows x 18 columns]

In [ ]:
#mapping
train['Spending_Score'] = train['Spending_Score'].map({'Low':0,'Average':1,'High':2})

In [ ]:
train.head()

   Gender  Ever_Married  Age  ...  Var_1_Cat_4  Var_1_Cat_6  Var_1_other
0       1             0   22  ...            1            0            0
1       0             1   38  ...            1            0            0
2       0             1   67  ...            0            1            0
3       1             1   67  ...            0            1            0
4       0             1   40  ...            0            1            0

[5 rows x 19 columns]

In [ ]:
df_test['Spending_Score'] = df_test['Spending_Score'].map({'Low':0,'Average':1,'High':2})

In [ ]:
df_test.head()

   Gender  Ever_Married  Age  ...  Var_1_Cat_4  Var_1_Cat_6  Var_1_other
0       0             1   36  ...            0            1            0
1       1             1   37  ...            0            1            0
2       0             1   69  ...            0            1            0
3       1             1   59  ...            0            1            0
4       0             0   19  ...            0            1            0

[5 rows x 18 columns]

In [ ]:
X = train.drop('Segmentation',axis =1)
y = train['Segmentation']

In [ ]:
from sklearn.linear_model import LogisticRegression
lr = LogisticRegression()

In [ ]:
lr.fit(X,y)

/usr/local/lib/python3.7/dist-packages/sklearn/linear_model/_logistic.py:940: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  extra_warning_msg=_LOGISTIC_SOLVER_CONVERGENCE_MSG)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [ ]:
prediction = lr.predict(df_test)

In [ ]:
prediction

array(['A', 'D', 'B', ..., 'A', 'B', 'D'], dtype=object)

In [ ]:
#submission
submission = pd.DataFrame()
submission['ID'] = test['ID']
submission['Segmentation'] = prediction

In [ ]:
submission.to_csv('logistic.csv',index = False)

In [ ]:
from google.colab import drive
drive.mount('/content/drive')